/******************************************************************************

                  版权所有 (C), 2008-2009, 华为技术有限公司

 ******************************************************************************
  文 件 名   : dfhas.h
  版 本 号   : 初稿
  部    门   : 
  作    者   : s00120510
  生成日期   : 2013年9月5日
  最近修改   :
  功能描述   : dfhas.c 的头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年9月5日
    作    者   : s00120510
    修改内容   : 创建文件

******************************************************************************/

#ifndef __DFHAS_H__
#define __DFHAS_H__


#ifdef __cplusplus
#if __cplusplus
extern "C"{
#endif
#endif /* __cplusplus */



#ifdef __cplusplus
#if __cplusplus
}
#endif
#endif /* __cplusplus */


#endif /* __DFHAS_H__ */

