
/******************************************************************************

                  版权所有 (C), 2012-2022, 华为技术有限公司

 ******************************************************************************
  文 件 名   : TargetTempFanControl.h
  版 本 号   : 初稿
  作    者   : liuyunju 00220850
  生成日期   : 2013年6月14日
  最近修改   :
  功能描述   : 多点分区的目标温度控制供BMC调用的接口linux版本,支持分区联动控制
  函数列表   :
  修改历史   :
  1.日    期   : 2013年6月14日
    作    者   : liuyunju 00220850
    修改内容   : 创建文件

******************************************************************************/
#ifndef TARGETTEMPFANCONTROL_H
#define TARGETTEMPFANCONTROL_H
/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*由PID风扇控制模块定义, 提供给BMC, BMC调用刷新配置信息,以及实时温度信息, 对应帧格式的标识位01-05, ObjTempPidBuff输入为按照1.3帧格式定义;*/
extern gint32 WriteInfo(gint8* const pcObjTempPidBuff);

/*由PID风扇控制模块定义, 提供给BMC, BMC调用刷新转速信息; 对应帧格式的标识位06; ObjTempPidBuff输入为按照1.3帧格式定义;*/
extern gint32 ReadInfo(gint8* const pcObjTempPidBuff);

/* 获取决定风扇转速的传感器编号 */
gint32 PidGetFanSpeedFactor(gint8* const pcSpeedFactorBuff, guint32 buf_len);

/*由PID风扇控制模块定义, 提供给BMC,BMC初始化时调用该函数, 使PID风扇控制模块起来;*/
extern gint32 FanControlTaskInit(void);

/*PID 模块初始化入口*/
extern gint32 InitialPIDModule(void);

typedef guint32 (*PID_REGLOG_FN)(const gchar * pcModName, const gchar* pcLogLevel, gchar *acLineBuf,guint32 ulLen);
/*由PID风扇控制模块定义，提供给BMC，BMC初始化时调用该函数，给PID风扇模块注册日志记录函数*/
extern guint32 PIDRegWriteLogFn(PID_REGLOG_FN pfnRegLog);
/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
#endif

