export const tiny3Entries = {
    tiLocaleKey: 'ru-RU',
    tiCommon: {
        okBtn: 'Да',
        cancelBtn: 'Отмена'
    },
    tiActionmenu: {
        more: 'Еще',
        operation: 'Операция'
    },
    tiValid: {
        errorMsg: {
            required: 'Это поле не может оставаться пустым.',
            maxLength: 'Введите не более {0} символов.',
            minLength: 'Введите минимум {0} символов.',
            rangeSize: 'Введите от {0} до {1} символов.',
            maxValue: 'Введите значение не более или равно {0}.',
            minValue: 'Введите значение более или равное {0}.',
            rangeValue: 'Введите значение от {0} до {1}.',
            regExp: 'Неверное значение.',
            contains: 'Значение должно содержать следующие символы: {0}.',
            notContains: 'Значение не может содержать следующие недопустимые символы: {0}.',
            notScript: 'Значение не может содержать теги скрипта.',
            equal: 'Значение должно быть {0}.',
            notEqual: 'Значение не может быть {0}.',
            port: 'Введите целое число от {0} до {1}.',
            path: 'Введите правильный путь к файлу.',
            email: 'Введите правильный адрес эл. почты.',
            date: 'Введите действительную дату.',
            url: 'Введите корректный URL-адрес.',
            integer: 'Введите действительное целое число.',
            number: 'Введите действительное число.',
            digits: 'Введите действительное число.',
            ipv4: 'Введите действительный адрес IPv4.',
            ipv6: 'Введите действительный адрес IPv6.',
            password: 'Неверный пароль.'
        },
        message: {
            rangeSize: 'Длина символов должна быть от {0} до {1}.',
            minCharType: 'Должно содержать минимум {0} разных символа: прописные буквы, строчные буквы, цифры и специальный символ (`~!@#$%^&*()-_=+\|[{}];:\'",<.>/? и пробел).',
            notEqualPosRev: 'Невозможно использовать ни имя пользователя, ни имя пользователя в обратном порядке.'
        },
        passwordStrength: {
            securityText: 'Надежность пароля:',
            levelDecArr: ['Низкая', 'средняя', 'высокая']
        }
    },
    tiPagination: {
        gotoLabel: 'Переходить',
        prevTitle: 'Пред.',
        nextTitle: 'След.',
        totalLabel: 'Всего записей: '
    },
    tiMessage: {
        prompt: 'Информация',
        warn: 'Предупреждение',
        confirm: 'Подтвердить',
        error: 'Ошибка',
        ok: 'Да',
        cancel: 'Отмена'
    },
    tiUpload: {
        selectFileTip: 'Выбрать файл',
        uploadBtnDisableTip: 'Выберите файл, который хотите загрузить.',
        addFile: 'Выбрать файл',
        error: 'Не удалось загрузить файл.',
        successInfo: 'Файл успешно загружен.',
        addSuccessSingleInfo: 'Файл был добавлен.',
        uploadingSingleInfo: 'Идет загрузка',
        errorSingleInfo: 'Не удалось загрузить файл.',
        addSuccessMutiInfo: 'Добавление {0} файлов завершено.',
        uploadingMutiInfo: 'Идет загрузка: {0}',
        errorMultiInfo: 'Не удалось загрузить {0} файлов.',
        clearAll: 'Удалить все',
        upload: 'Передано',
        cancel: 'Отмена',
        reload: 'Загрузить снова'
    },
    tiDate: {
        dateFormat: 'd MMM yyyy',
        datePlaceholder: 'Выберите дату.',
        datetimePlaceholder: 'Выберите дату и время.',
        timeFormat: 'HH:mm:ss',
        weekNamesAbb: ['Вс', 'Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб'],
        weeknamesTitle: ['Воскресенье', 'понедельник', 'вторник', 'среда', 'четверг', 'пятница', 'суббота'],
        monthNamesAbb: ['янв', 'февр', 'март', 'апр', 'май', 'июнь', 'июль', 'авг', 'сент', 'окт', 'нояб', 'дек'],
        btnSliderArr: ['1', '2', '3', '4', '5', '6', '7', '8', '9 мес.', '1 год', '2 года', '3 года'],
        yearSuffixLabel: '',
        rangeBeginLabel: 'Начальная дата',
        rangeEndLabel: 'Конечная дата'
    },
    tiSelect: {
        search: 'Поиск'
    },
    tiList: {
        selectAll: '(Выбрать все)'
    },
    tiIntro: {
        skip: 'Пропустить',
        previous: 'Пред.',
        next: 'След.',
        finish: 'Завершить'
    }
};
