/******************************************************************************

                  版权所有 (C), 2016-2021, 华为技术有限公司

 ******************************************************************************
  文 件 名   : sml.h
  版 本 号   : 初稿
  作    者   : huanghan (h00282621)
  生成日期   : 2016年2月25日
  最近修改   :
  功能描述   : 华为自研的存储设备管理库(Storage Management Library)对外提供的数据结构及接口
  函数列表   :
  修改历史   :
  1.日    期   : 2016年2月25日
    作    者   : huanghan (h00282621)
    修改内容   : 创建文件

******************************************************************************/
#ifndef SML_H
#define SML_H

#include "sml_base.h"
#include "sml_common.h"
#include "sml_oob.h"
#include "sml_ctrl.h"
#include "sml_pd.h"
#include "sml_ld.h"

#endif